   //у цьому файлі кожен з вас бере по функції зі списку і пише її реалізацію.
   //ряд заданий масивом
   //і потім викликає створену функцію у головній програмі

#include <iostream>
#include <limits> //бібліотека зі збереженими константами мін і макс. значень різних типів
//#include <cfloat>
double ryad[20] = {1.1,2.3,2,4,8,8.9,-3,-4.5,5,11,14,-6.1,6.2,7,0.5,0.9,2.3,8.6,2.22,3}; //ряд

using namespace std;

double maxValue(double ryad[]){
   double maxV =-std::numeric_limits<double>::max(); // зберігаю в локальну змінну мінімальне значення в діапазоні double
   for (int i=0; i<20; i++){ //перебираю ряд
      if (ryad[i]>maxV){// якщо елемент ряду більше maxV,
        maxV=ryad[i]; // то в maxV записую значення елемента
      }
   }
   return maxV; //повертаю змінну
}
/*
....
   сюди додаєте ваші функції (бажано почати з сортування)
....
*/
int main()
{   //викликаю мою функцію
    cout<<"Max value of the ryad is "<<maxValue(ryad)<<endl;
    //викликаєте ваші функції

    return 0;
}
